org/20211120141719-chess_openings.org
:PROPERTIES:
:ID:       ef88b5ed-d028-4bf1-b939-e709c1bbbcf7
:END:
#+title: Chess openings
#+filetags: :chess:public:

#+header: :imagemagick "t"
#+header: :results file raw
#+header: :exports results
#+header: :iminoptions -density 1000 :imoutoptions -geometry 400

Here are the areas in which I am confident I can improve over current material:
- Better exploration of the different variations;
  /Graph visualizations/ can probably help to [[id:7dae4406-eb94-4496-93e1-a989cab14729][explore linked openings]] when we're on an opening page.
- Show side-to-side the board and the squares respectively controlled by White and Black (helpful when learning);
  To do this we can use the ==python-chess== library to get the attacked squares, and render the chessboard with $\LaTeX$'s ==chessboard== library to keep the same graphic chart.
- Show common threats in openings (which explains why some variations are never played, which is always a bit mysterious as a beginner)

* Starting points

- [[id:432c587b-091b-425b-86d5-aeb15a437702][Evans' Gambit]]
- [[id:05382094-6899-4806-b60c-ab641050609e][The Sicilian defense]]


* TODO Correlation between the scores given by MCO to openings and Lichess database :noexport:

* References

- [[id:c8732670-f25b-4bb0-9102-5020de539f1a][Discovering chess openings: building opening skills from basic principles]]
  It would be interesting to list all the principles that are listed in the book and check whether they are followed in such and such openings.
- [[id:76013e56-547a-4732-9cec-a1ce9c048f20][Modern chess openings, 15th edition]]
