20211120141719-chess_openings.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-30 Tue 20:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chess openings</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Chess openings</h1>
<p>
Here are the areas in which I am confident I can improve over current material:
</p>
<ul class="org-ul">
<li>Better exploration of the different variations;
<i>Graph visualizations</i> can probably help to <a href="20211125113956-my_digital_garden.html#ID-7dae4406-eb94-4496-93e1-a989cab14729">explore linked openings</a> when we're on an opening page.</li>
<li>Show side-to-side the board and the squares respectively controlled by White and Black (helpful when learning);
To do this we can use the <code>=python-chess=</code> library to get the attacked squares, and render the chessboard with \(\LaTeX\)'s <code>=chessboard=</code> library to keep the same graphic chart.</li>
<li>Show common threats in openings (which explains why some variations are never played, which is always a bit mysterious as a beginner)</li>
</ul>

<div id="outline-container-org413c3d1" class="outline-2">
<h2 id="org413c3d1">Starting points</h2>
<div class="outline-text-2" id="text-org413c3d1">
<ul class="org-ul">
<li><a href="20211203092256-evans_gambit.html#ID-432c587b-091b-425b-86d5-aeb15a437702">Evans' Gambit</a></li>
<li><a href="20211129083835-the_sicilian_defense.html#ID-05382094-6899-4806-b60c-ab641050609e">The Sicilian defense</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgf746596" class="outline-2">
<h2 id="orgf746596">References</h2>
<div class="outline-text-2" id="text-orgf746596">
<ul class="org-ul">
<li><a href="20211203090938-discovering_chess_openings_building_opening_skills_from_basic_principles.html#ID-c8732670-f25b-4bb0-9102-5020de539f1a">Discovering chess openings: building opening skills from basic principles</a>
It would be interesting to list all the principles that are listed in the book and check whether they are followed in such and such openings.</li>
<li><a href="20211203091102-modern_chess_openings_15th_edition.html#ID-76013e56-547a-4732-9cec-a1ce9c048f20">Modern chess openings, 15th edition</a></li>
</ul>
</div>
</div>

<div id="outline-container-org95a7966" class="outline-2">
<h2 id="org95a7966">Links to this note</h2>
<div class="outline-text-2" id="text-org95a7966">
<ul class="org-ul">
<li><a href="./20211120084044-chess.html">Chess</a></li>
<li><a href="./20211201165647-how_to_take_notes.html">How to take notes</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
